copyright=(c) \u0410\u043d\u0434\u0440\u043e\u0441\u043e\u0432 \u0412\u0430\u0434\u0438\u043c

exit=\u0412\u044b\u0445\u043e\u0434

exit_prompt=\u0412\u044b \u0434\u0435\u0439\u0441\u0442\u0432\u0438\u0442\u0435\u043b\u044c\u043d\u043e \u0445\u043e\u0442\u0438\u0442\u0435 \u0432\u044b\u0439\u0442\u0438 \u0438\u0437 \u0434\u0435\u043c\u043e\u043d\u0441\u0442\u0440\u0430\u0446\u0438\u0438?

demo_caption=\u041f\u0440\u0435\u0437\u0435\u043d\u0442\u0430\u0446\u0438\u044f \u043a\u043e\u043c\u043f\u043e\u043d\u0435\u043d\u0442\u0430 "\u041a\u0430\u043b\u0435\u043d\u0434\u0430\u0440\u044c"


back=\u041D\u0430\u0437\u0430\u0434

next=\u0414\u0430\u043B\u0435\u0435
Start=\u0417\u0430\u043F\u0443\u0441\u043A
ShowDialog=\u041F\u043E\u043A\u0430\u0437\u0430\u0442\u044C \u0434\u0438\u0430\u043B\u043E\u0433

StartConfigurator=\u0417\u0430\u043F\u0443\u0441\u0442\u0438\u0442\u044C \u043D\u0430\u0441\u0442\u0440\u043E\u0439\u0449\u0438\u043A
sayPane4_1=\u041F\u043E\u044D\u0442\u043E\u043C\u0443 \u0431\u0438\u0431\u043B\u0438\u043E\u0442\u0435\u043A\u0430 \u0441 \u043A\u043E\u043C\u043F\u043E\u043D\u0435\u043D\u0442\u0430\u043C\u0438 \u044F\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u0437\u0430\u043F\u0443\u0441\u043A\u0430\u0435\u043C\u044B\u043C \u0444\u0430\u0439\u043B\u043E\u043C. \u041F\u0440\u0438 \u0437\u0430\u043F\u0443\u0441\u043A\u0435 \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u044C \u043F\u043E\u043B\u0443\u0447\u0430\u0435\u0442 \u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E\u0441\u0442\u044C \u0432\u043E\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u044C\u0441\u044F \u0432\u0441\u0435\u043C\u0438 \u043D\u0430\u0441\u0442\u0440\u043E\u0439\u043A\u0430\u043C\u0438 \u043F\u043E\u0441\u0440\u0435\u0434\u0441\u0442\u0432\u043E\u043C \u043A\u043B\u0430\u0441\u0441\u0430 Customizer. \u041D\u0430\u0441\u0442\u0440\u043E\u0439\u043A\u0438 \u043C\u043E\u0433\u0443\u0442 \u0431\u044B\u0442\u044C \u0441\u043E\u0445\u0440\u0430\u043D\u0435\u043D\u044B \u0438 \u0437\u0430\u0442\u0435\u043C \u0437\u0430\u0433\u0440\u0443\u0436\u0435\u043D\u044B \u0441 \u043F\u043E\u043C\u043E\u0449\u044C\u044E \u0441\u043F\u0435\u0446\u0438\u0430\u043B\u044C\u043D\u043E\u0433\u043E \u043A\u043B\u0430\u0441\u0441\u0430. \u0422\u0430\u043A\u0438\u043C \u043E\u0431\u0440\u0430\u0437\u043E\u043C, \u0434\u043B\u044F \u0441\u0432\u043E\u0435\u0433\u043E \u043F\u043E\u043B\u043D\u043E\u0446\u0435\u043D\u043D\u043E\u0433\u043E \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u043D\u0438\u044F \u0431\u0438\u0431\u043B\u0438\u043E\u0442\u0435\u043A\u0430 \u0432\u043E\u043E\u0431\u0449\u0435 \u043D\u0435 \u0442\u0440\u0435\u0431\u0443\u0435\u0442 \u043D\u0430\u043B\u0438\u0447\u0438\u044F \u0441\u043F\u0435\u0446\u0438\u0430\u043B\u044C\u043D\u043E\u0439 \u0441\u0440\u0435\u0434\u044B \u0440\u0430\u0437\u0440\u0430\u0431\u043E\u0442\u043A\u0438
sayPane3_4=\u0414\u0430\u043B\u0435\u043A\u043E \u043D\u0435 \u0432\u0441\u0435 \u0441\u0440\u0435\u0434\u044B \u0440\u0430\u0437\u0440\u0430\u0431\u043E\u0442\u043A\u0438 \u0441\u043F\u043E\u0441\u043E\u0431\u043D\u044B \u043A\u043E\u0440\u0440\u0435\u043A\u0442\u043D\u043E \u0440\u0430\u0431\u043E\u0442\u0430\u0442\u044C \u0441 JavaBean \u043A\u043E\u043C\u043F\u043E\u043D\u0435\u043D\u0442\u0430\u043C\u0438, \u043E\u0441\u043E\u0431\u0435\u043D\u043D\u043E \u043F\u0440\u0438 \u043D\u0430\u043B\u0438\u0447\u0438\u0438 \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u044C\u0441\u043A\u0438\u0445 \u0440\u0435\u0434\u0430\u043A\u0442\u043E\u0440\u043E\u0432. \u0412 NetBeans, \u0433\u0434\u0435 \u0438 \u0440\u0430\u0437\u0440\u0430\u0431\u0430\u0442\u0438\u0432\u0430\u043B\u0438\u0441\u044C \u043A\u043E\u043C\u043F\u043E\u043D\u0435\u043D\u0442\u044B \u0432\u0441\u0435 \u0440\u0430\u0431\u043E\u0442\u0430\u0435\u0442, \u043D\u043E \u0432 \u0434\u0440\u0443\u0433\u0438\u0445 \u0441\u0440\u0435\u0434\u0430\u0445 \u043F\u0440\u043E\u0433\u0440\u0430\u043C\u043C\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u044F \u0432\u043E\u0437\u043D\u0438\u043A\u0430\u044E\u0442 \u043F\u0440\u043E\u0431\u043B\u0435\u043C\u044B, \u043F\u0440\u0438\u0447\u0435\u043C \u0440\u0430\u0437\u043D\u044B\u0435\: <UL><LI><b>BeanBox</b> \u043D\u0435 \u043E\u0442\u043E\u0431\u0440\u0430\u0436\u0430\u0435\u0442 \u0441\u0432\u043E\u0439\u0441\u0442\u0432\u0430, \u0434\u043B\u044F \u043A\u043E\u0442\u043E\u0440\u044B\u0445 \u0434\u043E\u043F\u0443\u0441\u0442\u0438\u043C\u043E \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 null<LI><b>IntelliJ IDEA</b> \u0432\u043E\u043E\u0431\u0449\u0435 \u043D\u0435 \u043F\u043E\u0434\u0434\u0435\u0440\u0436\u0438\u0432\u0430\u0435\u0442 \u043A\u043B\u0430\u0441\u0441\u0430 BeanInfo<LI><b>Eclipse</b> \u043D\u0435 \u0438\u043C\u0435\u0435\u0442 \u0432 \u0441\u0442\u0430\u043D\u0434\u0430\u0440\u0442\u043D\u043E\u0439 \u043F\u043E\u0441\u0442\u0430\u0432\u043A\u0435 \u0432\u0438\u0437\u0443\u0430\u043B\u044C\u043D\u043E\u0433\u043E \u0440\u0435\u0434\u0430\u043A\u0442\u043E\u0440\u0430 \u0433\u0440\u0430\u0444\u0438\u0447\u0435\u0441\u043A\u0438\u0445 \u0438\u043D\u0442\u0435\u0440\u0444\u0435\u0439\u0441\u043E\u0432</UL>
sayPane3_3=\u041D\u0430 \u0437\u0430\u0434\u043D\u0435\u043C \u0444\u043E\u043D\u0435 \u043C\u043E\u0436\u043D\u043E \u0440\u0430\u0437\u043C\u0435\u0441\u0442\u0438\u0442\u044C \u0438\u0437\u043E\u0431\u0440\u0430\u0436\u0435\u043D\u0438\u0435 \u043E\u0434\u043D\u0438\u043C \u0438\u0437 \u0441\u043F\u043E\u0441\u043E\u0431\u043E\u0432 (\u0432\u043F\u0438\u0441\u0430\u0442\u044C, \u043F\u043E \u0446\u0435\u043D\u0442\u0440\u0443, \u0437\u0430\u043C\u043E\u0441\u0442\u0438\u0442\u044C), \u0447\u0442\u043E\u0431\u044B \u0435\u0433\u043E \u043C\u043E\u0436\u043D\u043E \u0431\u044B\u043B\u043E \u0443\u0432\u0438\u0434\u0435\u0442\u044C \u0434\u043B\u044F \u043A\u0430\u0436\u0434\u043E\u0433\u043E \u0442\u0438\u043F\u0430 \u043A\u043B\u0435\u0442\u043A\u0438 \u0438\u043C\u0435\u044E\u0442\u0441\u044F \u043D\u0430\u0441\u0442\u0440\u043E\u0439\u043A\u0438 \u043F\u043E\u043B\u0443\u043F\u0440\u043E\u0437\u0440\u0430\u0447\u043D\u043E\u0441\u0442\u0438. <br>\u042D\u0442\u0430 \u0444\u0443\u043D\u043A\u0446\u0438\u044F, \u043A\u0430\u043A \u0438 \u0432\u0441\u0435 \u043E\u0441\u0442\u0430\u043B\u044C\u043D\u044B\u0435, \u043F\u043E\u0434\u0434\u0435\u0440\u0436\u0438\u0432\u0430\u0435\u0442\u0441\u044F \u0441\u043F\u0435\u0446\u0438\u0430\u043B\u044C\u043D\u044B\u043C \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u044C\u0441\u043A\u0438\u043C \u0440\u0435\u0434\u0430\u043A\u0442\u043E\u0440\u043E\u043C
sayPane3_2=\u0412\u0441\u0435 \u043A\u043B\u0435\u0442\u043A\u0438 \u043A\u0430\u043B\u0435\u043D\u0434\u0430\u0440\u044F \u043E\u0442\u043D\u043E\u0441\u044F\u0442\u0441\u044F \u043A \u043E\u0434\u043D\u043E\u043C\u0443 \u0438\u0437 \u0442\u0438\u043F\u043E\u0432\: \u0437\u0430\u0433\u043E\u043B\u043E\u0432\u043E\u043A (\u0432\u044B\u0432\u043E\u0434\u044F\u0442 \u0434\u043D\u0438 \u043D\u0435\u0434\u0435\u043B\u0438), \u043F\u0440\u043E\u043A\u0440\u0443\u0442\u043A\u0430 (\u0434\u043D\u0438 \u0441\u043E\u0441\u0435\u0434\u043D\u0435\u0433\u043E \u043C\u0435\u0441\u044F\u0446\u0430), \u0432\u044B\u0431\u0440\u0430\u043D\u043D\u044B\u0435, \u043F\u043E \u0443\u043C\u043E\u043B\u0447\u0430\u043D\u0438\u044E, \u043D\u0435\u0434\u043E\u0441\u0442\u0443\u043F\u043D\u044B\u0435. <br> \u0414\u043B\u044F \u043A\u0430\u0436\u0434\u043E\u0439 \u043A\u043B\u0435\u0442\u043A\u0438 \u043C\u043E\u0436\u043D\u043E \u043D\u0430\u0441\u0442\u0440\u043E\u0438\u0442\u044C \u0446\u0432\u0435\u0442 \u0444\u043E\u043D\u0430, \u0433\u0440\u0430\u043D\u0438\u0446\u0443, \u0448\u0440\u0438\u0444\u0442, \u0446\u0432\u0435\u0442 \u043A\u0443\u0440\u0441\u043E\u0440\u0430, \u0446\u0432\u0435\u0442 \u0442\u0435\u043A\u0441\u0442\u0430<br>\u0414\u043B\u044F \u043F\u043E\u043B\u043D\u043E\u0446\u0435\u043D\u043D\u043E\u0439 \u0440\u0430\u0431\u043E\u0442\u044B \u0441\u043E \u0432\u0441\u0435\u043C\u0438 \u0434\u043E\u0441\u0442\u0443\u043F\u043D\u044B\u043C\u0438 \u043D\u0430\u0441\u0442\u0440\u043E\u0439\u043A\u0430\u043C\u0438 \u043C\u043E\u0436\u043D\u043E \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u044C \u0441\u043F\u0435\u0446\u0438\u0430\u043B\u044C\u043D\u044B\u0435 \u0440\u0435\u0434\u0430\u043A\u0442\u043E\u0440\u044B,  \u0432\u0441\u0442\u0440\u043E\u0435\u043D\u043D\u044B\u0435 \u0432 \u0431\u0438\u0431\u043B\u0438\u043E\u0442\u0435\u043A\u0443
sayPane3_1=\u0422\u0430\u043A\u0436\u0435 \u043F\u043E\u0434\u0434\u0435\u0440\u0436\u0438\u0432\u0430\u044E\u0442\u0441\u044F \u0441\u0432\u043E\u0431\u043E\u0434\u043D\u043E \u043D\u0430\u0441\u0442\u0440\u0430\u0438\u0432\u0430\u0435\u043C\u044B\u0435 \u0432\u043D\u0435\u0448\u043D\u0438\u0435 \u0432\u0438\u0434\u044B (\u0438\u043C\u0435\u0435\u0442\u0441\u044F \u0440\u044F\u0434 \u0433\u043E\u0442\u043E\u0432\u044B\u0445 \u0442\u0435\u043C, \u043E\u0434\u043D\u0430\u043A\u043E \u0441 \u043F\u043E\u043C\u043E\u0449\u044C\u044E \u0432\u0441\u0442\u0440\u043E\u0435\u043D\u043D\u044B\u0445 \u0432 \u0431\u0438\u0431\u043B\u0438\u043E\u0442\u0435\u043A\u0443 \u0440\u0435\u0434\u0430\u043A\u0442\u043E\u0440\u043E\u0432 \u043C\u043E\u0436\u043D\u043E \u0441\u043E\u0437\u0434\u0430\u0432\u0430\u0442\u044C \u043E\u0440\u0438\u0433\u0438\u043D\u0430\u043B\u044C\u043D\u044B\u0435 \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u044C\u0441\u043A\u0438\u0435 \u0442\u0435\u043C\u044B)
sayPane2_2=\u041F\u043E\u0434\u0434\u0435\u0440\u0436\u0438\u0432\u0430\u0435\u043C\u044B\u0435 \u043D\u0430\u0441\u0442\u0440\u043E\u0439\u043A\u0438 \u0440\u0430\u0431\u043E\u0442\u044B \u0441 \u0434\u0430\u0442\u0430\u043C\u0438\: <UL><LI>\u0414\u0430\u0442\u0430 \u043F\u043E \u0443\u043C\u043E\u043B\u0447\u0430\u043D\u0438\u044E(\u043E\u0434\u043D\u0430 \u0438\u043B\u0438 \u043D\u0435\u0441\u043A\u043E\u043B\u044C\u043A\u043E)<LI>\u041C\u0438\u043D\u0438\u043C\u0430\u043B\u044C\u043D\u0430\u044F \u0434\u0430\u0442\u0430<LI>\u041C\u0430\u043A\u0441\u0438\u043C\u0430\u043B\u044C\u043D\u0430\u044F \u0434\u0430\u0442\u0430<LI>\u0417\u0430\u043F\u0440\u0435\u0449\u0435\u043D\u043D\u044B\u0435 \u0434\u0430\u0442\u044B</UL>
sayPane2_1=\u041F\u0430\u043D\u0435\u043B\u044C \u0432\u044B\u0431\u043E\u0440\u0430 \u0434\u0430\u0442\u044B \u043F\u043E\u0437\u0432\u043E\u043B\u044F\u0435\u0442 \u0433\u0438\u0431\u043A\u043E \u043D\u0430\u0441\u0442\u0440\u0430\u0438\u0432\u0430\u0442\u044C \u0438\u043D\u0442\u0435\u0440\u0444\u0435\u0439\u0441. \u041F\u043E \u0443\u043C\u043E\u043B\u0447\u0430\u043D\u0438\u044E \u043F\u0440\u0435\u0434\u043B\u0430\u0433\u0430\u0435\u0442\u0441\u044F \u0432\u043D\u0435\u0448\u043D\u0438\u0439 \u0432\u0438\u0434 "Swing", \u043F\u043E\u0437\u0432\u043E\u043B\u044F\u044E\u0449\u0438\u0439 \u043A\u043E\u043C\u043F\u043E\u043D\u0435\u043D\u0442\u0443 \u043E\u0440\u0433\u0430\u043D\u0438\u0447\u043D\u043E \u0441\u043C\u043E\u0442\u0440\u0435\u0442\u044C\u0441\u044F \u0441\u0440\u0435\u0434\u0438 \u0441\u0442\u0430\u043D\u0434\u0430\u0440\u0442\u043D\u044B\u0445 \u044D\u043B\u0435\u043C\u0435\u043D\u0442\u043E\u0432 \u0443\u043F\u0440\u0430\u0432\u043B\u0435\u043D\u0438\u044F. <br>\u041F\u043E\u043B\u043D\u0430\u044F \u043F\u043E\u0434\u0434\u0435\u0440\u0436\u043A\u0430 Look & feel.<br>\u041A\u043E\u043C\u043F\u043E\u043D\u0435\u043D\u0442 \u043C\u043E\u0436\u0435\u0442 \u043A\u043E\u0440\u0440\u0435\u043A\u0442\u043D\u043E \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u044C \u0432\u0441\u0435 \u043B\u043E\u043A\u0430\u043B\u0438\u0437\u0430\u0446\u0438\u0438, \u0432\u043A\u043B\u044E\u0447\u0435\u043D\u043D\u044B\u0435 \u0434\u043B\u044F \u0434\u0430\u0442 \u0432 jsdk. \u041A\u0440\u043E\u043C\u0435 \u0442\u043E\u0433\u043E \u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u0435\u043B\u044C\u0441\u043A\u0438\u0435 \u0440\u0435\u0434\u0430\u043A\u0442\u043E\u0440\u044B \u0441\u0432\u043E\u0439\u0441\u0442\u0432 \u043F\u043E\u0434\u0434\u0435\u0440\u0436\u0438\u0432\u0430\u044E\u0442 \u043D\u0430 \u0434\u0430\u043D\u043D\u044B\u0439 \u043C\u043E\u043C\u0435\u043D\u0442 2 \u044F\u0437\u044B\u043A\u0430\: \u0440\u0443\u0441\u0441\u043A\u0438\u0439 \u0438 \u0430\u043D\u0433\u043B\u0438\u0439\u0441\u043A\u0438\u0439.
sayPane1_5=\u041E\u0441\u043E\u0431\u044B\u0435 \u0441\u0432\u043E\u0439\u0441\u0442\u0432\u0430 \u0434\u0438\u0430\u043B\u043E\u0433\u043E\u0432\u043E\u0433\u043E \u043E\u043A\u043D\u0430\: <UL> <LI>\u042D\u0442\u043E \u043D\u0435\u0432\u0438\u0437\u0443\u0430\u043B\u044C\u043D\u044B\u0439 \u043A\u043E\u043C\u043F\u043E\u043D\u0435\u043D\u0442<LI>\u0417\u0430\u0433\u043E\u043B\u043E\u0432\u043E\u043A \u043E\u043A\u043D\u0430<LI>\u041C\u043E\u0434\u0430\u043B\u044C\u043D\u043E\u0441\u0442\u044C </UL>
sayPane1_4=\u0420\u0430\u0441\u043A\u0440\u044B\u0432\u0430\u044E\u0449\u0438\u0439\u0441\u044F \u0441\u043F\u0438\u0441\u043E\u043A \u0434\u043B\u044F \u0432\u044B\u0431\u043E\u0440\u0430 \u043E\u0434\u043D\u043E\u0439 \u0434\u0430\u0442\u044B\: <UL><LI>\u041F\u043E\u0434\u0442\u0432\u0435\u0440\u0436\u0434\u0435\u043D\u0438\u0435 \u0432\u044B\u0431\u043E\u0440\u0430 \u043E\u0441\u0443\u0449\u0435\u0441\u0442\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u0430\u0432\u0442\u043E\u043C\u0430\u0442\u0438\u0447\u0435\u0441\u043A\u0438<LI>\u0414\u0430\u0442\u0443 \u043C\u043E\u0436\u043D\u043E \u0432\u0432\u043E\u0434\u0438\u0442\u044C \u0432 \u0442\u0435\u043A\u0441\u0442\u043E\u0432\u043E\u0435 \u043F\u043E\u043B\u0435, \u043F\u0440\u0438\u0434\u0435\u0440\u0436\u0438\u0432\u0430\u044F\u0441\u044C \u0432\u044B\u0431\u0440\u0430\u043D\u043D\u043E\u0433\u043E \u0444\u043E\u0440\u043C\u0430\u0442\u0430</UL>
sayPane1_3=\u0420\u0430\u0441\u043A\u0440\u044B\u0432\u0430\u044E\u0449\u0438\u0439\u0441\u044F \u0441\u043F\u0438\u0441\u043E\u043A \u0441 \u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E\u0441\u0442\u044C\u044E \u043C\u043D\u043E\u0436\u0435\u0441\u0442\u0432\u0435\u043D\u043D\u043E\u0433\u043E \u0432\u044B\u0431\u043E\u0440\u0430\: <UL> <LI>\u041F\u043E\u0434\u0442\u0432\u0435\u0440\u0436\u0434\u0435\u043D\u0438\u0435 \u0432\u044B\u0431\u043E\u0440\u0430 \u043E\u0441\u0443\u0449\u0435\u0441\u0442\u0432\u043B\u044F\u0435\u0442\u0441\u044F \u043F\u043E\u0441\u0440\u0435\u0434\u0441\u0442\u0432\u043E\u043C \u0434\u0432\u043E\u0439\u043D\u043E\u0433\u043E \u0449\u0435\u043B\u0447\u043A\u0430 \u0438\u043B\u0438 \u043D\u0430\u0436\u0430\u0442\u0438\u044F Enter <LI>\u041E\u0442\u043C\u0435\u043D\u0430 \u0432\u044B\u0431\u043E\u0440\u0430 - \u0441 \u043F\u043E\u043C\u043E\u0449\u044C\u044E \u043A\u043B\u0430\u0432\u0438\u0448\u0438 Ecs <LI>\u0412\u043E\u0437\u043C\u043E\u0436\u043D\u043E\u0441\u0442\u044C \u043D\u0430\u0441\u0442\u0440\u0430\u0438\u0432\u0430\u0442\u044C \u0444\u043E\u0440\u043C\u0430\u0442 \u0432\u044B\u0432\u043E\u0434\u0430 \u0434\u0430\u0442 (\u043F\u043E\u043B\u043D\u044B\u0439, \u0434\u043B\u0438\u043D\u043D\u044B\u0439, \u0441\u0440\u0435\u0434\u043D\u0438\u0439, \u043A\u0440\u0430\u0442\u043A\u0438\u0439) </UL>
sayPane1_2=\u041E\u0441\u043D\u043E\u0432\u043D\u044B\u0435 \u0441\u0432\u043E\u0439\u0441\u0442\u0432\u0430 \u043F\u0430\u043D\u0435\u043B\u0438\: <UL> <LI>\u0412\u043E\u0437\u043C\u043E\u0436\u043D\u043E\u0441\u0442\u044C \u0432\u044B\u0431\u043E\u0440\u0430 \u043D\u0435\u0441\u043A\u043E\u043B\u044C\u043A\u0438\u0445 \u0434\u0430\u0442\u044B (\u043F\u043E\u0434\u0434\u0435\u0440\u0436\u043A\u0430 \u043A\u043B\u0430\u0432\u0438\u0448 Shift, Ctrl, Alt, \u041F\u0440\u043E\u0431\u0435\u043B, \u043F\u0440\u043E\u0442\u044F\u0433\u0438\u0432\u0430\u043D\u0438\u044F \u043C\u044B\u0448\u043A\u043E\u0439) <LI>\u0410\u0432\u0442\u043E\u043C\u0430\u0442\u0438\u0447\u0435\u0441\u043A\u0430\u044F \u043F\u0440\u043E\u043A\u0440\u0443\u0442\u043A\u0430 \u043F\u0440\u0438 \u0432\u044B\u0431\u043E\u0440\u0435 \u0447\u0438\u0441\u043B\u0430 \u0438\u0437 \u0441\u043E\u0441\u0435\u0434\u043D\u0435\u0433\u043E \u043C\u0435\u0441\u044F\u0446\u0430 <LI>\u0423\u043F\u0440\u0430\u0432\u043B\u0435\u043D\u0438\u0435 \u0441 \u043A\u043B\u0430\u0432\u0438\u0430\u0442\u0443\u0440\u044B (\u0441\u0442\u0440\u0435\u043B\u043A\u0438, \u0441\u043C\u0435\u043D\u0430 \u043C\u0435\u0441\u044F\u0446\u0430 \u0438 \u0433\u043E\u0434\u0430 \u0441 \u043F\u043E\u043C\u043E\u0449\u044C\u044E \u043A\u043B\u0430\u0432\u0438\u0448 PgUp, PgDown, Home, End)  </UL>
sayPane1_1=\u0411\u0438\u0431\u043B\u0438\u043E\u0442\u0435\u043A\u0430 \u0441\u043E\u0434\u0435\u0440\u0436\u0438\u0442 \u0442\u0440\u0438 \u043A\u043E\u043C\u043F\u043E\u043D\u0435\u043D\u0442\u0430 \u0434\u043B\u044F \u0432\u044B\u0431\u043E\u0440\u0430 \u0434\u0430\u0442\: <UL> <LI>\u041F\u0430\u043D\u0435\u043B\u044C <LI>\u0420\u0430\u0441\u043A\u0440\u044B\u0432\u0430\u044E\u0449\u0438\u0439\u0441\u044F \u0440\u0435\u0434\u0430\u043A\u0442\u043E\u0440 <LI>\u0414\u0438\u0430\u043B\u043E\u0433\u043E\u0432\u043E\u0435 \u043E\u043A\u043D\u043E  </UL>
sayPaneExit_1=\u041F\u0440\u0435\u0437\u0435\u043D\u0442\u0430\u0446\u0438\u044F \u0437\u0430\u043A\u043E\u043D\u0447\u0435\u043D\u0430. \u0414\u0430\u043B\u0435\u0435 \u0412\u044B \u043C\u043E\u0436\u0435\u0442\u0435 \u0432\u043E\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u044C\u0441\u044F \u043D\u0430\u0441\u0442\u0440\u043E\u0439\u0449\u0438\u043A\u043E\u043C \u0431\u0438\u0431\u043B\u0438\u043E\u0442\u0435\u043A\u0438 (\u0442\u043E\u0433\u043E \u0436\u0435 \u044D\u0444\u0444\u0435\u043A\u0442\u0430 \u043C\u043E\u0436\u043D\u043E \u0434\u043E\u0431\u0438\u0442\u044C\u0441\u044F \u043F\u0440\u043E\u0441\u0442\u043E \u0437\u0430\u043F\u0443\u0441\u0442\u0438\u0432 \u0431\u0438\u0431\u043B\u0438\u043E\u0442\u0435\u043A\u0443)
sayPaneExit_2=\u041F\u0440\u0435\u0437\u0435\u043D\u0442\u0430\u0446\u0438\u044F \u0437\u0430\u0432\u0435\u0440\u0448\u0435\u043D\u0430
sayPane5_1=\u041D\u0430\u0447\u0438\u043D\u0430\u044F \u0441 \u0432\u0435\u0440\u0441\u0438\u0438 1.1, \u043F\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u043B\u0435\u043D\u044B \u0440\u0438\u0441\u043E\u0432\u0430\u043B\u044C\u0449\u0438\u043A\u0438 \u0438 \u0440\u0435\u0434\u0430\u043A\u0442\u043E\u0440\u044B \u044F\u0447\u0435\u0435\u043A \u0442\u0430\u0431\u043B\u0438\u0446 \u0434\u043B\u044F \u0432\u0438\u0437\u0443\u0430\u043B\u044C\u043D\u044B\u0445 \u043A\u043E\u043C\u043F\u043E\u043D\u0435\u043D\u0442\u043E\u0432. <br><br> \u0418\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0439\u0442\u0435 \u043C\u0435\u0442\u043E\u0434 <b>someVisualDateChooserBean.createTableCellRenderer()<b>, \u0447\u0442\u043E\u0431\u044B \u043F\u0440\u0435\u0432\u0440\u0430\u0442\u0438\u0442\u044C \u043A\u043E\u043C\u043F\u043E\u043D\u0435\u043D\u0442 \u0432 \u0440\u0438\u0441\u043E\u0432\u0430\u043B\u044C\u0449\u0438\u043A \u044F\u0447\u0435\u0435\u043A \u0438 <b>someVisualDateChooserBean.createTableCellEditor()<b>, \u0447\u0442\u043E\u0431\u044B \u043F\u043E\u043B\u0443\u0447\u0438\u0442\u044C \u0440\u0435\u0434\u0430\u043A\u0442\u043E\u0440.
sayPane5_2=\u0422\u0430\u043A\u0436\u0435 \u0432 \u0432\u0435\u0440\u0441\u0438\u0438 1.1\: <UL> <LI>\u0423\u043B\u0443\u0447\u0448\u0435\u043D\u0430 \u0434\u043E\u043A\u0443\u043C\u0435\u043D\u0442\u0430\u0446\u0438\u044F. \u0422\u0430\u043A\u0436\u0435 \u0442\u0435\u043F\u0435\u0440\u044C \u043E\u043D\u0430 \u043D\u0430 \u0440\u0443\u0441\u0441\u043A\u043E\u043C \u0438 \u0430\u043D\u0433\u043B\u0438\u0439\u0441\u043A\u043E\u043C \u044F\u0437\u044B\u043A\u0430\u0445<LI>\u041A\u043B\u0430\u0441\u0441 BeanUtils\: \u043F\u043E\u0437\u0432\u043E\u043B\u044F\u0435\u0442 \u0443\u0441\u0442\u0430\u043D\u0430\u0432\u043B\u0438\u0432\u0430\u0442\u044C \u0441\u0432\u043E\u0439\u0441\u0442\u0432\u0430 \u043E\u0434\u043D\u043E\u0433\u043E \u043A\u043E\u043C\u043F\u043E\u043D\u0435\u043D\u0442\u0430 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u044F \u0434\u0440\u0443\u0433\u043E\u0439<LI>\u0414\u043B\u044F \u043A\u043E\u043C\u043F\u043E\u043D\u0435\u043D\u0442\u043E\u0432 \u0434\u043E\u0441\u0442\u0443\u043F\u043D\u0430 \u043E\u043F\u0435\u0440\u0430\u0446\u0438\u044F \u043A\u043B\u043E\u043D\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u044F</UL>
